IDEA Open Model
WarningMessage Constructor (MessageNumber, OpenObject, String, String, OpenMessage)
Compatible with IDEA StatiCa Beta 20.0
 Constructor
 Namespace: IdeaRS.OpenModel.Message
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public WarningMessage(
	MessageNumber number,
	OpenObject openObject,
	string propertyName,
	string description,
	OpenMessage innerMessage = null
)
Public Sub New (
	number As MessageNumber,
	openObject As OpenObject,
	propertyName As String,
	description As String,
	Optional innerMessage As OpenMessage = Nothing
)
Parameters
number
Type: IdeaRS.OpenModel.Message.MessageNumber
Number of the message
openObject
Type: IdeaRS.OpenModel.OpenObject
Affected object
propertyName
Type: System.String
Affected property
description
Type: System.String
Description of the message
innerMessage (Optional)
Type: IdeaRS.OpenModel.Message.OpenMessage
Inner message
See Also
Reference
WarningMessage Class
WarningMessage Overload
IdeaRS.OpenModel.Message Namespace